```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_dynamodb_table.terraform_locks: Refreshing state... [id=federalist-terraform-locks]
aws_iam_user.federalist_ecr_write: Refreshing state... [id=federalist-ecr-write]
aws_ecr_repository.federalist_ecr: Refreshing state... [id=federalist/garden-build]
aws_iam_user.federalist_ecr_read: Refreshing state... [id=federalist-ecr-read]
aws_s3_bucket.terraform_state: Refreshing state... [id=federalist-terraform-state]
aws_iam_access_key.federalist_ecr_read_access_key: Refreshing state... [id=AKIAWNYQRJFGA2342SG7]
aws_iam_access_key.federalist_ecr_write_access_key: Refreshing state... [id=AKIAWNYQRJFGHHGGD57O]
aws_iam_user_policy.federalist_ecr_read: Refreshing state... [id=federalist-ecr-read:federalist-ecr-read]
aws_iam_user_policy.federalist_ecr_write: Refreshing state... [id=federalist-ecr-write:federalist-ecr-write]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecr_read_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr_read_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "arn:aws-us-gov:ecr:::*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.ecr_write_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr_write_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "arn:aws-us-gov:ecr:::*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:CompleteLayerUpload",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:TagResource",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_ecr_repository.federalist_ecr will be created
  + resource "aws_ecr_repository" "federalist_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "federalist/garden-build"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

  # aws_iam_access_key.federalist_ecr_read_access_key will be created
  + resource "aws_iam_access_key" "federalist_ecr_read_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-ecr-read"
    }

  # aws_iam_access_key.federalist_ecr_write_access_key will be created
  + resource "aws_iam_access_key" "federalist_ecr_write_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-ecr-write"
    }

  # aws_iam_user.federalist_ecr_read will be created
  + resource "aws_iam_user" "federalist_ecr_read" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-ecr-read"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user.federalist_ecr_write will be created
  + resource "aws_iam_user" "federalist_ecr_write" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-ecr-write"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.federalist_ecr_read will be created
  + resource "aws_iam_user_policy" "federalist_ecr_read" {
      + id     = (known after apply)
      + name   = "federalist-ecr-read"
      + policy = (known after apply)
      + user   = "federalist-ecr-read"
    }

  # aws_iam_user_policy.federalist_ecr_write will be created
  + resource "aws_iam_user_policy" "federalist_ecr_write" {
      + id     = (known after apply)
      + name   = "federalist-ecr-write"
      + policy = (known after apply)
      + user   = "federalist-ecr-write"
    }

  # aws_s3_bucket.terraform_state will be created
  + resource "aws_s3_bucket" "terraform_state" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "federalist-terraform-state"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```